{
 "events": [
  {
   "id": 1,
   "title": "Iron Man",
   "image": "1.png",
   "description": "Playboy and visionary industrial genius Tony Stark, CEO of leading military defense contractor, Stark Industries, is at a casino, 
blowing off an award ahead of a big day in war-torn Kunar, Afghanistan, to demonstrate his company's new Jericho missile. With him is his friend and military liaison,
 Lieutenant Colonel James Rhodes, a member of the United States Air Force, they arrive.
While riding in a transport convoy, Stark is critically wounded in an ambush and held captive in a cave by the Ten Rings.
 An electromagnet built by fellow captive Ho Yinsen keeps the shrapnel that wounded Stark from reaching his heart and killing him. 
The Ten Rings leader, Raza Hamidmi al-Wazar, offers Stark freedom; in exchange, Stark must build a Jericho missile for the terrorists.
 Stark and Yinsen agree that al-Wazar will not keep his word of letting Stark live.
While pretending to work on the missile, Stark and Yinsen secretly build a powerful electric generator called an Arc Reactor to power Stark's electromagnet.
They then begin to build a powered suit of armor, designed by Stark, to help them escape. 
The Ten Rings ambush the workshop when they discover Stark's plan, but Yinsen sacrifices himself to distract them while Stark's suit powers up.
 Using the armored suit, Stark fights his way out of the cave to find a mortally wounded Yinsen, who reassures Stark and urges him to continue his escape and not waste his life.
 An enraged Stark leaves the cave, burns the terrorist's stockpile of Stark Industries-produced weapons, and flies away.
Having escaped, Stark crashes in the desert, which destroys the suit.
Having been rescued by a search party, including Rhodes, Stark returns home.
He calls a press conference to announce that his company will no longer manufacture weapons, having seen first-hand the strife that they cause in the wrong hands.
Obadiah Stane, his father's old partner and the company's manager, informs Stark that this may ruin Stark Industries and his father's legacy."
  },
  {
   "id": 2,
   "title": "SpiderMan",
   "image": "spider1.png",
   "description": "With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, 
forcing Peter to discover what it truly means to be Spider-Man.
Peter Parker's secret identity is revealed to the entire world.
Desperate for help, Peter turns to Doctor Strange to make the world forget that he is Spider-Man.
The spell goes horribly wrong and shatters the multiverse, bringing in monstrous villains that could destroy the world.
Picking up where Far From Home left off, Peter Parker's whole world is turned upside down when his old enemy Mysterio posthumously reveals his identity to the public.
Wanting to make his identity a secret, Peter turns to Doctor Strange for help. But when Strange's spell goes haywire, Peter must go up against five deadly new enemies--the Green Goblin,
 Dr. Octopus, Electro, the Lizard and Sandman--all while discovering what it truly means to be Spider-Man.
"With Spider-Man's identity now revealed, our friendly neighborhood web-slinger is unmasked and no longer able to separate his normal life as Peter Parker from the high stakes of being a superhero.
When Peter asks for help from Doctor Strange, the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.
With his identity compromised, right after the spectacular confrontation with super-hero charlatan Mysterio in Spider-Man: Far from Home (2019),
Peter Parker is now with his back to the wall.
On the run and having no one to turn to for advice, desperate Peter seeks a radical and equally dangerous solution to right a wrong,
utterly unaware of the grave consequences of his ill-advised decision.
And, as the unfathomable Multiverse expands with a vengeance, formidable adversaries from a not-so-distant past, too, seek closure, demanding the Spider's head on a platter.
But when there's no way home and nowhere to hide, who can Parker trust?"

  },
  {
   "id": 3,
   "title": "Deadpool",
   "image": "deadpool.jpg",
   "description": "Wade Wilson is a New York City mercenary—a.k.a. he roughs up bad guys for a quick and relatively easy buck. At his favorite bar, Sister Margaret's School for Wayward Girls,
he meets a prostitute named Vanessa and they strike up a relationship.Shortly after Wade and Vanessa get engaged, Wade is diagnosed with late-stage cancer.
That night at Sister Margaret's, Wade's friend (and bartender) Weasel tells Wade that there's a mysterious recruiter waiting for him.
The recruiter says that the people he works for will not only cure Wade's cancer, but also turn him into a superhero.
Wade initially declines on the grounds that heroism isn't his cup of tea, but later changes his mind.Bring on the super powers.
Now, it's nearly impossible for him to die, and he has a single mission: Find Ajax. To cover his gnarly appearance, Wade fashions a costume, including a full mask,
and reinvents himself as Deadpool. He moves into an apartment with an elderly woman named Blind Al, and begins working his way through Ajax's organization,
trying to track down Ajax. All the while, Wade doesn't tell Vanessa that he's alive for fear of her reaction when she sees his new look.
After killing several of Ajax's low-level thugs, Deadpool meets the recruiter again, and he tells Deadpool where to find Ajax.
Deadpool intercepts their convoy as they charge down the highway, causing a massive collision and maximum carnage.
Colossus sees this on the news, and he and his protégé, Negasonic Teenage Warhead, travel to the scene of the accident to apprehend Deadpool—and recruit him for the X-Men.
While Colossus gives Deadpool his pitch, Ajax escapes from Deadpool.Ajax goes to Sister Margaret's and spots a photo of Wade and Vanessa that Weasel tacked up behind the bar.
Aided by Colossus and Negasonic Teenage Warhead, Deadpool battles Ajax, who's backed up by his right-hand woman, Angel Dust, and a team of armed thugs.
Deadpool and Ajax face off once again, and when Deadpool has Ajax down for the count, Ajax reveals that there's no cure for Deadpool's disfigurement; he was lying the whole time.
Just as Deadpool is about to kill Ajax, Colossus tells him not to; he urges Deadpool to make the heroic decision to spare Ajax's life. Deadpool shoots Ajax in the head.
Lastly, Deadpool has to deal with Vanessa. She's more than a little bit ticked that her fiancé has been alive this whole time without telling her.
Deadpool removes his mask, and while Vanessa is taken aback by his appearance at first, she quickly tells Wade she doesn't care, and that she'll get used to it.
They make out amidst the rubble while Deadpool plays Wham's "Careless Whisper" on his phone."
  },
  {
   "id": 4,
   "title": "Captain America",
   "image": "captainamerica.jpg",
   "description": "In the present day, researchers in the Arctic Circle uncover the buried wreckage of a large, wing-shaped aircraft.
While investigating the aircraft's interior, two of the researchers discover a frozen, circular object with a red, white and blue motif.
In March 1942, HYDRA forces led by Johann Schmidt invade a stone church in Tønsberg, Norway, seeking a mysterious cosmic artifact known as the Tesseract, which possesses untold powers.
Upon discovering the true Tesseract, Schmidt has the Church Keeper who guarded it killed, along with everyone else in the village.
In 1943, Steve Rogers is once again rejected for military duty on the battlefields of World War II, despite making multiple attempts at different enlistment offices.
While attending Stark Expo with Bucky Barnes, Rogers attempts to enlist again.
After overhearing Rogers' conversation with Barnes about wanting to help in the war, Abraham Erskine allows Rogers to enlist as a candidate of Project Rebirth,
a super-soldier experiment being conducted by the Strategic Scientific Reserve under the supervision of Erskine, Chester Phillips, and Peggy Carter.
During basic training, Phillips is unconvinced by Erskine's claims that Rogers is the right person for the procedure,
but relents after seeing Rogers commit an act of self-sacrificing bravery. The night before the treatment, Erskine reveals to Rogers that Schmidt underwent an imperfect version
 of the procedure and suffered negative side-effects due to his inner ambition for power and obsession with becoming a superior man.
However, he reassures Rogers that he chose him because he believed Rogers was an inherently good man and one that, because he had been weak his whole life,
would not lose respect for the strength he would gain. Back in Europe, Schmidt and Arnim Zola, using one of his machines, successfully harness the energies of the Tesseract,
intending to use the power to fuel Zola's inventions. Meanwhile, Schmidt, having discovered Erskine's location, dispatches an assassin to kill him.
In New York City, Erskine subjects Rogers to the super-soldier treatment, putting him in a special chamber where he is injected with the Super Soldier Serum and dosed with vita-rays.
After witnessing the success of the experiment, one of the attendees reveals himself to be Schmidt's assassin, Heinz Kruger, who shoots Erskine, killing him.
Kruger grabs the last vial of the Super-Soldier Serum and escapes the facility into the streets of New York.
Rogers runs after Kruger, using his new strength and stamina to run down Kruger's car on foot.
Despite attempting to escape in a submarine, Rogers manages to catch Kruger, but the vial of Super Soldier Serum is broken in the process and the assassin immediately commits
suicide by cyanide pill before he can be interrogated for information."
  },
  {
   "id": 5,
   "title": "Thor",
   "image": "thor.jpg",
   "description": "In the realm of Asgard, where towering castles pierce the heavens and gods walk among mortals, Thor, the son of Odin, stands as a beacon of strength and valor.
With his mighty hammer, Mjolnir, he commands respect and admiration from his people. However, his arrogance and impulsiveness often lead him down perilous paths.
Thor's Arrogance Ignites Conflict
In a moment of recklessness, Thor breaks a sacred truce with the frost giants, the ancient enemies of Asgard.
This act of defiance ignites a conflict that threatens to engulf the Nine Realms in war.
Odin, the wise and all-seeing king of Asgard, sees the impending destruction and the role his son has played in bringing it about.
As punishment for his actions, Odin banishes Thor to Earth, a realm he deems unworthy of his son's presence. Stripped of his powers and his hammer,
Thor finds himself a stranger in a strange land, surrounded by creatures he once considered insignificant.
In New Mexico, a place far removed from the grandeur of Asgard, Thor encounters Jane Foster, a brilliant astrophysicist intrigued by the mysterious events surrounding his arrival.
 Despite his weakened state, Thor's charisma and unwavering spirit draw Jane to him, and an unlikely bond begins to form.
Back in Asgard, Thor's cunning brother, Loki, seizes the opportunity to rule in Odin's absence.
Consumed by envy and a thirst for power, Loki plots to unleash the destructive forces of the frost giants upon Jotunheim, the realm of his enemies.
Unbeknownst to Thor, Jane and her team stumble upon the hidden location of Mjolnir. The hammer, a symbol of Thor's power and worthiness,
holds the key to his redemption and Asgard's salvation. Despite the risks, Jane decides to help Thor reclaim his rightful place as Asgard's protector.
As Thor regains his strength and confronts Loki, a clash of epic proportions unfolds.
Thor's newfound humility and understanding of the consequences of his actions empower him to make difficult choices and protect the realms from Loki's destructive ambitions.
Through his trials and tribulations, Thor learns the true meaning of heroism, understanding that true strength lies not in arrogance and power but in humility, compassion,
and the willingness to make difficult choices for the greater good. In the end, Thor emerges as a hero, not just to Asgard, but to all the realms."
  },
  {
   "id": 6,
   "title": "Doctor Stranger",
   "image": "doctor.jpg",
   "description": "Doctor Strange Season 1 follows the story of Stephen Strange, a brilliant but arrogant neurosurgeon who loses the use of his hands in a car accident.
Desperate to regain his former life, he seeks out unconventional treatments, leading him to the Ancient One, a mystical sorcerer who trains him to become the Master of Mystic Arts.
In this new world of magic and sorcery, Strange faces not only physical challenges but also internal struggles, grappling with his newfound powers and the responsibilities they entail.
 He must learn to balance his ego with humility, his intellect with wisdom, and his surgical precision with the unpredictability of magic.
As Strange delves deeper into the mystical realms, he encounters a variety of allies and adversaries, including Wong, the Ancient One's loyal servant; Mordo,
a fellow sorcerer who becomes his rival; and Dormammu, a powerful warlord from the Dark Dimension who threatens to engulf the universe in darkness.
Throughout his journey, Strange discovers that true power lies not in external forces but in the mastery of one's own mind and spirit.
He learns to harness his inner potential, channeling his once-arrogant ambition into a force for good.
In the climactic showdown, Strange confronts Dormammu, using his newfound powers and strategic brilliance to outwit the tyrannical warlord.
With the fate of the universe hanging in the balance, Strange makes a daring sacrifice that demonstrates his growth as a hero and his commitment to protecting the world.
Doctor Strange Season 1 concludes with Strange embracing his role as the Sorcerer Supreme, dedicating himself to safeguarding the Earth from mystical threats and upholding 
the balance between dimensions. He has transformed from a self-serving surgeon into a selfless protector, ready to face whatever challenges lie ahead."
  }
 ]
}
