{
  "events": [
    {
      "id": 1,
      "title": "Iron Man",
      "image": "1.png",
      "video": "iron-man.mp4",
      "description": "Tony Stark,a billionaire genius and industrialist,is the CEO of Stark Industries,one of the world's leading weapons manufacturers.While presenting a new weapons system to the U.S.military in Afghanistan,Tony is captured by a terrorist organization called the Ten Rings.Forced to build a powerful weapon for his captors,Tony instead secretly creates a high-tech armored suit to escape his captivity."
    },
    {
      "id": 2,
      "title": "Spider-Man",
      "image": "spider1.png",
      "video": "spiderman.mp4",
      "description": "Peter Parker's life is turned upside down when his identity as Spider-Man is revealed to the world. Desperate to protect his loved ones, he turns to Doctor Strange for help. Strange casts a spell to make everyone forget that Peter is Spider-Man, but the spell goes awry, and villains from alternate universes are brought into their world."
    },
    {
      "id": 3,
      "title": "Deadpool",
      "image": "deadpool.jpg",
      "video": "deadpool.mp4",
      "description": "Former Special Forces operative Wade Wilson becomes the wisecracking mercenary Deadpool after being subjected to a rogue experiment that leaves him with accelerated healing powers but also a scarred physical appearance."
    },
    {
      "id": 4,
      "title": "Captain America",
      "image": "captainamerica.jpg",
      "video": "captainAmerica.mp4",
      "description": "Set during World War II, Captain America: The First Avenger tells the story of Steve Rogers, a frail but determined young man who dreams of serving his country. Despite his physical limitations, Steve is selected to participate in an experimental super-soldier program that transforms him into Captain America, the perfect soldier."
    },
    {
      "id": 5,
      "title": "Thor",
      "image": "thor.jpg",
      "video": "thor.mp4",
      "description": "In the realm of Asgard, the mighty God of Thunder, Thor, is arrogant and self-absorbed. His impulsive behavior leads to a disastrous battle with the frost giants of Jotunheim, resulting in the shattering of the Bifrost, the bridge connecting the Nine Realms."
    },
    {
      "id": 6,
      "title": "Doctor Strange",
      "image": "doctor.jpg",
      "video": "doctorStrange.mp4",
      "description": "Dr. Stephen Strange, a brilliant but arrogant neurosurgeon, loses the use of his hands in a devastating car accident. Desperate to regain his former life, he embarks on a perilous journey to Kamar-Taj, a mystical realm hidden in the Himalayas, seeking a cure."
    }
  ]
}
